# Dados absolutos e relativos

In [1]:
import pandas as pd

## Percentuais

In [2]:
data = {'emprego':['Admin_bd', 'Programador', 'Arquiteto_redes'],
       'nova_jersey':[97350, 82080, 112840],
       'florida': [77140, 71540, 62310]}

In [3]:
type(data)

dict

In [4]:
data

{'emprego': ['Admin_bd', 'Programador', 'Arquiteto_redes'],
 'nova_jersey': [97350, 82080, 112840],
 'florida': [77140, 71540, 62310]}

In [5]:
df = pd.DataFrame(data)
df

           emprego  nova_jersey  florida
0         Admin_bd        97350    77140
1      Programador        82080    71540
2  Arquiteto_redes       112840    62310

In [6]:
df['nova_jersey'].sum()

292270

In [7]:
df['florida'].sum()

210990

In [9]:
df['%_nova_jersey'] = (df['nova_jersey'] / df['nova_jersey'].sum()) * 100
df

           emprego  nova_jersey  florida  %_nova_jersey
0         Admin_bd        97350    77140      33.308242
1      Programador        82080    71540      28.083621
2  Arquiteto_redes       112840    62310      38.608136

In [10]:
df['%_florida'] = (df['florida'] / df['florida'].sum()) * 100
df

           emprego  nova_jersey  florida  %_nova_jersey  %_florida
0         Admin_bd        97350    77140      33.308242  36.560974
1      Programador        82080    71540      28.083621  33.906820
2  Arquiteto_redes       112840    62310      38.608136  29.532205